In [2]:
import pandas as pd

## 1. train 데이터 불러오기

In [3]:
# 데이터 불러오기
train = pd.read_csv('data/train.csv', index_col='PassengerId')
train.head(3)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

## 2. train 데이터 확인하기
    - shape
    - info
    - 결측치 확인

In [4]:
train.shape

(891, 11)

In [5]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [6]:
train.isnull()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,False,False,False,False,False,False,False,False,False,True,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,True,False
4,False,False,False,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...
887,False,False,False,False,False,False,False,False,False,True,False
888,False,False,False,False,False,False,False,False,False,False,False
889,False,False,False,False,True,False,False,False,False,True,False
890,False,False,False,False,False,False,False,False,False,False,False
891,False,False,False,False,False,False,False,False,False,True,False

In [8]:
train['Age'].isnull().sum()

np.int64(177)

## 3. 전처리 응용실습

### 3-1. Age

- Age 결측치를 전체 평균 나이값으로 채우기

In [13]:
train['Age'].fillna(train['Age'].mean().astype(int))

PassengerId
1      22.0
2      38.0
3      26.0
4      35.0
5      35.0
       ...
887    27.0
888    19.0
889    29.0
890    26.0
891    32.0
Name: Age, Length: 891, dtype: float64

In [14]:
train['Age']

PassengerId
1      22.0
2      38.0
3      26.0
4      35.0
5      35.0
       ...
887    27.0
888    19.0
889     NaN
890    26.0
891    32.0
Name: Age, Length: 891, dtype: float64

- Age 결측치를 성별 평균 or 중간 값으로 채우기

In [17]:
# 성별에 따른 나이 평균값
train.groupby('Sex')['Age'].median()

Sex
female    27.0
male      29.0
Name: Age, dtype: float64

In [23]:
train['Age'] = train['Age'].fillna(train.groupby('Sex')['Age'].transform('median'))

In [24]:
train.tail(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,27.0,1,2,W./C. 6607,23.45,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

### 3-2. 가장 빈도가 많은 값으로 Embarked 결측치 채우기

In [28]:
train['Embarked'].value_counts().index[0]

'S'

In [50]:
train['Embarked']=train['Embarked'].fillna(train['Embarked'].value_counts().idxmax())

In [51]:
train['Embarked'].isnull().sum()

np.int64(0)

In [52]:
train['Age'].isnull().sum()

np.int64(0)

## 4. 데이터 분석

- 성별에 따른 생존자 비율 
- 성별에 따른 사망자 비율

In [73]:
train.groupby('Sex')['Survived'].value_counts(1)*100

Sex     Survived
female  1           74.203822
        0           25.796178
male    0           81.109185
        1           18.890815
Name: proportion, dtype: float64

In [72]:
train[['Sex','Survived']].groupby('Sex')['Survived'].value_counts(1)*100

Sex     Survived
female  1           74.203822
        0           25.796178
male    0           81.109185
        1           18.890815
Name: proportion, dtype: float64

In [64]:
train['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

- 나이대별 생존/사망 비율 확인

In [85]:
bins=list(range(int(train['Age'].min()),int(train['Age'].max()+1),20 ))
lb = ['미성년자','청년','중년','장년']
train.insert(5, 'Cats', value = pd.cut(train['Age'], bins, labels=lb))

In [90]:
pd.DataFrame((train.groupby('Cats')['Survived'].value_counts(1)*100).round(1))

C:\Users\smhrd\AppData\Local\Temp\ipykernel_12700\1945675192.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  pd.DataFrame((train.groupby('Cats')['Survived'].value_counts(1)*100).round(1))

               proportion
Cats Survived
미성년자 0               54.2
     1               45.8
청년   0               63.5
     1               36.5
중년   0               60.9
     1               39.1
장년   0               77.3
     1               22.7

In [96]:
pd.DataFrame((train.groupby(['Sex','Cats'])['Survived'].value_counts(1)*100).round(1))

C:\Users\smhrd\AppData\Local\Temp\ipykernel_12700\1593855510.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  pd.DataFrame((train.groupby(['Sex','Cats' ])['Survived'].value_counts(1)*100).round(1))

                      proportion
Sex    Cats Survived
female 미성년자 1               68.8
            0               31.2
       청년   1               75.7
            0               24.3
       중년   1               75.6
            0               24.4
       장년   1              100.0
            0                0.0
male   미성년자 0               71.6
            1               28.4
       청년   0               83.4
            1               16.6
       중년   0               80.7
            1               19.3
       장년   0               89.5
            1               10.5